app/controllers/admin_controller.rb

SELECT * FROM "bugs" WHERE ("bugs"."submitter" = 'Koopa1' AND "bugs"."user_id" = 1)
SELECT * FROM "users" WHERE ("users"."name" = 'userTestOne' AND "users"."company_name" = 'TestCorp Ltd.') LIMIT 1
SELECT count(*) AS count_all FROM "bugs"
SELECT * FROM "bugs" WHERE ("bugs"."id" = 1)
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
SELECT * FROM "companies" WHERE ("companies"."id" = 1)
---
  def index
    @bugs = nil
    if request.post?

      if( params[:user][:company_name].blank? &&
          params[:user][:name].blank? &&
          params[:bug][:submitter].blank? )

        @bugs = Bug.find(:all)

      elsif( params[:user][:name].blank? &&
             params[:bug][:submitter].blank? )
        @bugs = Bug.find_all_by_user_id(
                   User.find_by_company_name(params[:user][:company_name]))

      elsif( params[:user][:company_name].blank? &&
             params[:bug][:submitter].blank? )

        @bugs = Bug.find_all_by_user_id(
                  User.find_by_name(params[:user][:name]))

      elsif( params[:user][:company_name].blank? &&
             params[:user][:name].blank? )

        @bugs = Bug.find_all_by_submitter(params[:bug][:submitter])

      elsif (params[:user][:company_name].blank? )

        @bugs = Bug.find(:all,
                   :conditions => ["user_id = ? and submitter = ?",
                                   User.find_by_name(params[:user][:name]),
                                   params[:bug][:submitter]])

      elsif (params[:user][:name].blank?)

        @bugs = Bug.find(:all,
                   :conditions => ["user_id = ? and submitter = ?",
                                   User.find_by_company_name(params[:user][:company_name]),
                                   params[:bug][:submitter]])