app/controllers/admin_controller.rb

  def index

    #Set up selection boxen choices
    @companies = Company.all
    @users = User.all

    params[:days] = params[:days].to_i


    if request.post?

      conditions = {}

      conditions[:user_id] = params[:user][:id] unless params[:user][:id].blank?

      conditions[:"users.company_id"] =
            params[:company][:id] unless params[:company][:id].blank?

    unless (params[:bug][:solved] == "All")
      conditions[:solved] = params[:bug][:solved] == "Yes" ? true : false
     end

    @bugs = Bug.last_n_days(params[:days]).find(
                        :all, :joins => :user, :conditions => conditions,
                                                :order => 'created_at DESC')
---
SELECT * FROM "companies"
SELECT "bugs".* FROM "bugs" INNER JOIN "users" ON "users".id = "bugs".user_id WHERE (bugs.created_at < '2009-07-18') ORDER BY created_at DESC