app/controllers/bugs_controller.rb

SELECT * FROM "bugs" WHERE ("bugs"."user_id" = 2)
---
  def index
    @bugs = Bug.find_all_by_user_id(session[:user_id])

SELECT * FROM "bugs" WHERE ("bugs"."id" = 1)
---
  def show
    @bug = Bug.find(params[:id])

INSERT INTO "bugs" ("reporter", "created_at", "updated_at", "subject", "description") VALUES('T3h Intarw3bz', '2009-05-26 19:44:00', '2009-05-26 19:44:00', 'MY PUTER DONT WORK', 'Halp! Mai compooper iz broked. i vieweded some lolcats n then i gots da virusses an nao mai compooper iz wont turn on. So can u fix it fur me kthxbai?')
---
  def create
    @bug = Bug.new(params[:bug])
    @bug.user_id = session[:user_id]

    respond_to do |format|
      if @bug.save

SELECT * FROM "bugs" WHERE ("bugs"."id" = 1)
UPDATE "bugs" SET "updated_at" = '2009-06-25 18:42:20', "solved" = 't' WHERE "id" = 1
---
  def update
    @bug = Bug.find(params[:id])


    respond_to do |format|
      if @bug.update_attributes(params[:bug])