app/controllers/users_controller.rb

  def index
    @users = User.find(:all, :order => :name)
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 3) LIMIT 1

  def create
    @company = Company.find(params[:user][:company_id])
    @user = @company.users.create(params[:user])
---
SELECT * FROM "companies" WHERE ("companies"."id" = 1)
SELECT * FROM "users" WHERE ("users"."id" = 3) LIMIT 1
INSERT INTO "users" ("name", "salt", "created_at", "userclass", "company_name", "updated_at", "hashed_password", "phone") VALUES('admin', '200426100.0795481850591975', '2009-06-02 23:29:55', 'admin', 'Victory Computers', '2009-06-02 23:29:55', '8faaa96f7adfb92e6332d4b24400f8154873e2d4', '2046687634')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 3) LIMIT 1
UPDATE "users" SET "updated_at" = '2009-06-23 21:20:07', "name" = 'userTestOneB' WHERE "id" = 4